Австралия/src/AccumulationRegisters/StockReceivedFromThirdParties/StockReceivedFromThirdParties.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>StockReceivedFromThirdParties</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ContentOfAccountingRecord</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Batch</name>
    <type>
      <types>CatalogRef.ProductsBatches</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Order</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.PurchaseOrder</types>
      <types>DocumentRef.WorkOrder</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/AccumulationRegisters/StockReceivedFromThirdParties/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

// Procedure creates an empty temporary table of records change.
//
Procedure CreateEmptyTemporaryTableChange(AdditionalProperties) Export
	
	If Not AdditionalProperties.Property("ForPosting")
	 OR Not AdditionalProperties.ForPosting.Property("StructureTemporaryTables") Then
		Return;
	EndIf;
	
	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
	Query = New Query(
	"SELECT TOP 0
	|	StockReceivedFromThirdParties.LineNumber AS LineNumber,
	|	StockReceivedFromThirdParties.Company AS Company,
	|	StockReceivedFromThirdParties.Products AS Products,
	|	StockReceivedFromThirdParties.Characteristic AS Characteristic,
	|	StockReceivedFromThirdParties.Batch AS Batch,
	|	StockReceivedFromThirdParties.Counterparty AS Counterparty,
	|	StockReceivedFromThirdParties.Order AS Order,
	|	StockReceivedFromThirdParties.Quantity AS QuantityBeforeWrite,
	|	StockReceivedFromThirdParties.Quantity AS QuantityChange,
	|	StockReceivedFromThirdParties.Quantity AS QuantityOnWrite
	|INTO RegisterRecordsStockReceivedFromThirdPartiesChange
	|FROM
	|	AccumulationRegister.StockReceivedFromThirdParties AS StockReceivedFromThirdParties");
	
	Query.TempTablesManager = StructureTemporaryTables.TempTablesManager;
	QueryResult = Query.Execute();
	
	StructureTemporaryTables.Insert("RegisterRecordsStockReceivedFromThirdPartiesChange", False);
	
EndProcedure

#EndRegion

#EndIf
